Repository: Belarus/OmegaT-Common.TMX
Catalog: tmx/non-segmented/drupal-7.x.tmx
Source language: en
Languages: be

source: The Number module defines various numeric field types for the Field module. Numbers can be in integer, decimal, or floating-point form, and they can be formatted when displayed. Number fields can be limited to a specific set of input values or to a range of values. See the <a href="@field-help">Field module help page</a> for more information about fields.
be: Модуль Number вызначае розныя лічбавыя тыпы дадзеных для палёў модуля Field. Лічбы могуць быць цэлымі, десятковымі, іррацыянальнымі. Яны могуць быць фарматаваныя, калі паказваюцца. Колькасць палёў можа быць абмежавана спецыфічным наборам значэнняў дадзеных увода ці вобласцю значэнняў. Глядзіце <a href="@field-help">Старонку дапамогі модуля Field</a> для атрымання большых звестак пра палі.

source: The OpenID module allows users to log in using the OpenID single sign on service. <a href="@openid-net">OpenID</a> is a secure method for logging into many websites with a single username and password. It does not require special software, and it does not share passwords with any site to which it is associated, including the site being logged into. The main benefit to users is that they can have a single password that they can use on many websites. This means they can easily update their single password from a centralized location, rather than having to change dozens of passwords individually. For more information, see the online handbook entry for <a href="@handbook">OpenID module</a>.
be: Модуль OpenID дазваляе карыстальнікам уваходзіць на сайт па асобным знакам OpenID. <a href="@openid-net">OpenID</a> з’яўляецца бяспечным метадам для ўваходу на шматлікія сайты толькі па імя карыстальніка і паролю. Ён не патрабуе адмысловага праграмнага зябеспячэння і не падае паролі ніводнаму сайту, з якімі звязан. У тым ліку і сайту, на які вы ўваходзіце. Галоўнай карысцю для карыстальнікаў з’яўляецца тое, што яны лёгка могуць выкарыстоўваць адзін пароль на шматлікіх сайтах. Гэта значыць, што яны лёгка могуць абнавіць іх асобны пароль цэнтралізавана, а не змяняць дзясяткі пароляў у індывідуальным парадку. Для падрабязнай інфармацыі глядзіце анлайн-даведнік па спасылцы <a href="@handbook"> модуль OpenID</a>.

source: The Options module defines checkbox, selection, and other input widgets for the Field module. See the <a href="@field-help">Field module help page</a> for more information about fields.
be: Модуль Наладкі вызначае пераключальнік, вылучаны элемент і іншыя ўключаныя віджэты для модуля Field. Глядзіце <a href="@field-help">старонку дапамогі модуля Field</a>, каб атрымаць больш інфармацыі пра палі.

source: The Overlay module makes the administration pages on your site display in a JavaScript overlay of the page you were viewing when you clicked the administrative link, instead of replacing the page in your browser window. Use the close link on the overlay to return to the page you were viewing when you clicked the link. For more information, see the online handbook entry for <a href="@overlay">Overlay module</a>.
be: Модуль Overlay замест замены старонкі ў акне вашага браўзера ажыццяўляе адлюстраванне старонак адміністравання вашага сайта ў перакрываючым слаі на той жа старонцы, якую вы праглядалі, калі націснулі спасылку адміністравання. Выкарыстоўвайце спасылку "закрыць" на перакрываючым слоі, каб вярнуцца да старонкі, якую вы праглядалі, калі націснулі на спасылку адміністравання. Для дадатковай інфармацыі, чытайце ў сеціўным даведніку пра <a href="@overlay">Модуль Overlay</a>.

source: The PHP filter module adds a PHP filter to your site, for use with <a href="@filter">text formats</a>. This filter adds the ability to execute PHP code in any text field that uses a text format (such as the body of a content item or the text of a comment). <a href="@php-net">PHP</a> is a general-purpose scripting language widely-used for web development, and is the language with which Drupal has been developed. For more information, see the online handbook entry for the <a href="@php">PHP filter module</a>.
be: Модуль PHP filter дадае PHP-фільтр на ваш сайт у фармат <a href="@filter">тэкставыя фарматы</a>. Гэты фільтр дадае магчымасць выконваць код PHP у любым тэкставым полі, што выкарыстоўвае тэкставы фармат (такі як цела элемента матэрыялу, або тэкст каментара). <a href="@php-net">PHP</a> - гэта адкрытая, шырока распаўсюджаная мова вэб-распрацоўкі і мова, на якой распрацавана сістэма Drupal. Для атрымання большых звестак глядзіце анлайн дапаможнік для <a href="@php">модуля PHP filter</a>.

source: The PHP filter module allows users with the proper permissions to include custom PHP code that will get executed when pages of your site are processed. While this is a powerful and flexible feature if used by a trusted user with PHP experience, it is a significant and dangerous security risk in the hands of a malicious or inexperienced user. Even a trusted user may accidentally compromise the site by entering malformed or incorrect PHP code. Only the most trusted users should be granted permission to use the PHP filter, and all PHP code added through the PHP filter should be carefully examined before use. <a href="@php-snippets">Example PHP snippets</a> can be found on Drupal.org.
be: Модуль PHP filter дае магчымасць карыстальнікам вызначаць права ўключаць PHP-код, які будзе выкананы калі старонкі будуць адчынены. Гэта магутная і гнуткая функцыя, для карыстальніка добра абазнанага ў PHP, гэта таксама значная рызыка і небяспека ў руках навічка ці зламысліка. Нават правераны карыстальнік можа выпадкова падарваць рэпутацыю сайта, уводзячы кепскі PHP-код. Толькі найболей надзейным карыстальнікам варта даваць дазволы на выкарыстанне PHP filter, і ўвесь PHP-код, дададзены праз PHP filter варта ўважліва правяраць перад выкарыстаннем. <a href="@php-snippets">Прыклады сніпэтаў на PHP</a> можа знайсці на Drupal.org.

source: The PHP module has been disabled. Any existing content that was using the PHP filter will now be visible in plain text. This might pose a security risk by exposing sensitive information, if any, used in the PHP code.
be: Модуль PHP быў адключаны. Любы існуючы змест, які выкарыстоўвае PHP фільтр цяпер будзе бачны ў простым тэксце. Выкрыццё канфідэнцыйнай інфармацыі, калі такая выкарыстоўваецца ў кодзе PHP, можа прадстаўляць пагрозу бяспекі.

source: The Path module allows you to specify an alias, or custom URL, for any existing internal system path. Aliases should not be confused with URL redirects, which allow you to forward a changed or inactive URL to a new URL. In addition to making URLs more readable, aliases also help search engines index content more effectively. Multiple aliases may be used for a single internal system path. To automate the aliasing of paths, you can install the contributed module <a href="@pathauto">Pathauto</a>. For more information, see the online handbook entry for the <a href="@path">Path module</a>.
be: Модуль Path дазваляе вам вызначаць псеўданімы, уласныя URL для любых існуючых, унутраных сістэмных шляхоў. Псеўданімы не павінны канфліктаваць з перанакіраваннямі URL, якія дазваляюць вам перанакіроўваць змененыя або не актыўныя URL на новыя URL. У дадатак робячы URL'ы больш чытальнымі, псеўданімы таксама дапамагаюць індэксаваць пошукавікамі матэрыялы сайта больш эфектыўна. Шмат псеўданімаў можа быць выкарыстана адным сістэмным шляхам. Каб аўтаматызаваць псеўданіміраванне шляхоў, вы можаце ўсталяваць унесены модуль <a href="@pathauto">Pathauto</a>. Для атрымання большых звестак, глядзіце анлайн дапаможнік па <a href="@path">модулю Path</a>.

source: The Path module provides a way to search and view a <a href="@aliases">list of all aliases</a> that are in use on your website. Aliases can be added, edited and deleted through this list.
be: Модудь Path дае магчымасць для пошуку і прагляду <a href="@aliases">спісу ўсіх псеўданімаў</a> выкарыстоўваемых на вашым сайце. Праз гэты ліст можна дадаваць, рэдагаваць і выдаляць псеўдамімы.

source: The Poll module can be used to create simple surveys or questionnaires that display cumulative results. A poll is a good way to receive feedback from site users and community members. For more information, see the online handbook entry for the <a href="@poll">Poll module</a>.
be: Модуль Poll можа быць выкарыстаны для стварэння простых апытанняў або анкет, якія адлюстроўваюць сукупны вынік. Апытанне ўяўляе сабой добры спосаб атрымаць зваротную сувязь ад карыстальнікаў сайта і членаў супольнасці. Для атрымання дадатковай інфармацыі глядзіце анлайн даведнік <a href="@poll"> модуля Poll </a>.

source: The Profile module allows site administrators to define custom fields (such as country, full name, or age) for user profiles, which are then displayed in the <a href="@user">My Account</a> section. This permits users of a site to share more information about themselves, and can help community-based sites organize users around specific information. For more information, see the online handbook entry for <a href="@profile">Profile module</a>.
be: Модуль Profile дазваляе адміністратарам сайта вызначаць уласныя палі профіляў карыстальніка (напрыклад, краіну, поўнае імя, ці ўзрост), якія потым адлюстроўваюцца ў падзеле <a href="@user">Мой Рахунак</a>. Гэта дазваляе карыстальнікам сайта дзяліцца інфармацыяй пра сябе, і дапамагае сайтам супольнасцяў арганізаваць карыстальнікаў адказна спецыфічнай інфармацыі. Для атрымання дадатковай інфармацыі глядзіце анлайн даведнік <a href="@profile">модуля Profile</a>.

source: The Profile module enables links to see further information about site users. You can view both a main <a href="@profile">User list page</a>, and more specified pages by clicking on linked fields in any profile. For example, the <a href="@profile-country">People who live in Canada</a> listing on Drupal.org displays all users who have entered <em>Canada</em> in the <em>Country</em> field on their user profile.
be: Модуль Profile дазваляе ўбачыць спасылкі на больш падрабязную інфармацыю аб карыстальніках сайта. Вы можаце праглядаць як асноўную <a href="@profile">Старонку карыстальніка</a>, так і пэўныя старонкі, націскаючы на звязаныя палі ў любым профілі. Напрыклад, лістынг <a href="@profile-country"> Людзей, якія жывуць у Канадзе </ a> на Drupal.org будзе адлюстроўваць усех карыстальнікаў, якія ўвялі <em>Канаду</em> ў поле <em>Краіна</em> ў сваім профілі карыстальніка.

source: The RDF module enriches your content with metadata to let other applications (e.g., search engines, aggregators, and so on) better understand its relationships and attributes. This semantically enriched, machine-readable output for Drupal sites uses the <a href="@rdfa">RDFa specification</a> which allows RDF data to be embedded in HTML markup. Other modules can define mappings of their data to RDF terms, and the RDF module makes this RDF data available to the theme. The core Drupal modules define RDF mappings for their data model, and the core Drupal themes output this RDF metadata information along with the human-readable visual information. For more information, see the online handbook entry for <a href="@rdf">RDF module</a>.
be: Модуль RDF узбагачае змесціва сайта метададзенымі, каб даць магчымасць іншым праграмам (пошукавікам, агрэгатарам і г.д.) лепш успрымаць яго сувязі і ўласцівасці. Гэтае семантычна узбагачанае, зразумелае для кампутараў змесціва для Drupal сайтаў выкарыстоўвае <a href="@rdfa">RDFa спецыфікацыю</a>, якая дазваляе размяшчаць даныя RDF у разметцы HTML. Іншыя модулі могуць вызначаць шляхі да сваёі інфармацыі праз тэрміны RDF, і модуль RDF зробіць гэтую RDF-інфармацыю дасяжнай для тэмы. Модулі ядра Drupal вызначаюць RDF-інфармацыю для сваіх мадэлей даных і тэмы ядра Drupal выводзяць гэтую інфармацыю адначасова візуальнай, даступнай для чалавека. Для атрымання дапамогі па тэме, зазірніце ў артыкул, змешчаны ў анлайн-даведніку, даступны па спасылцы <a href="@rdf">RDF модуль</a>.

source: The Search module includes a default <em>Search form</em> block, which can be enabled and configured on the <a href="@blocks">Blocks administration page</a>. The block is available to users with the <em>Search content</em> permission.
be: Модуль Search па змаўчанні выкарыстоўвае блок <em>Формы пошуку</em>, які можа быць уключаны і сканфігураваны на <a href="@blocks">Старонцы адміністравання блокаў</a>. Гэты блок даступны катыстальнікам з дазволам <em>Пошуку змесціва</em>.

source: The Search module provides the ability to index and search for content by exact keywords, and for users by username or e-mail. For more information, see the online handbook entry for <a href="@search-module">Search module</a>.
be: Модуль Search дае магчымасць індэксавання і пошуку змесціва па дакладных ключавых словах, і для карыстальнікаў - па імені карыстальніка ці адрасу электроннай пошты. Для атрымання дадатковай інфармацыі глядзіце анлайн даведнік <a href="@search-module">модуля Search</a>.

source: The Shortcut module allows users to create sets of <em>shortcut</em> links to commonly-visited pages of the site. Shortcuts are contained within <em>sets</em>. Each user with <em>Select any shortcut set</em> permission can select a shortcut set created by anyone at the site. For more information, see the online handbook entry for <a href="@shortcut">Shortcut module</a>.
be: 1 карыстальнік абраў або быў падпісаны на гэты набор хуткіх спасылак.Модуль Shortcut дазваляе карыстальнікам ствараць наборы <em>хуткіх спасылак</em> на найбольш наведвальных старонкі сайта. Хуткія спасылкі знаходзяцца ўнутры <em>набораў</em>. Кожны карыстальнік з правамі <em>Абраць любы набор хуткіх спасылак </em>, можа абраць набор хуткіх спасылак, створаных любым на сайце. Для падрабязнай інфармацыі глядзіце анлайн-даведнік у <a href="@shortcut">Модулі Shortcut</a>.

source: The Shortcut module creates an add/remove link for each page on your site; the link lets you add or remove the current page from the currently-enabled set of shortcuts (if your theme displays it and you have permission to edit your shortcut set). The core Seven administration theme displays this link next to the page title, as a small + or - sign. If you click on the + sign, you will add that page to your preferred set of shortcuts. If the page is already part of your shortcut set, the link will be a - sign, and will allow you to remove the current page from your shortcut set.
be: Модуль Shortcut стварае спасылку дадаць/выдаліць на кожную старонку вашага сайта; спасылка дазваляе вам дадаваць ці выдаляць бягучую старонку з дзейнага набора хуткіх спасылак ( калі ваша тэма адлюстроўвае гэта і ў вас ёсць правы рэдагаваць набор вашых хуткіх спасылак). Адміністрацыйная тэма ядра Seven адлюстроўвае гэтую спасылку побач з назвай старонкі, як маленькі знак + ці -. Калі вы націснеце знак +, вы дадасце гэтую старонку да свайго упадабанага набора хуткіх спасылак. Калі старонка уже з’яўляецца часткай вашага набора хуткіх спасылак, спасылка будзе са знакам – і будзе дазваляць вам выдаліць бягучую старонку з набора хуткіх спасылак.

source: The Statistics module can help you break down details about your users and how they are using the site. The module offers four reports:
be: Модуль Statistics можа дапамагаць вам аналізаваць дэталі пра вашых карыстальнікаў, і як яны выкарыстоўваюць сайт. Модуль прапануе чатыры справаздачы:

source: The Statistics module includes a counter for each page that increases whenever the page is viewed. To use the counter, enable <em>Count content views</em> on the <a href="@statistics-settings">statistics settings page</a>, and set the necessary <a href="@permissions">permissions</a> (<em>View content hits</em>) so that the counter is visible to the users.
be: Модуль Statistics утрымоўвае лічыльнік для кожнай старонкі, значэнні якога павялічваюцца кожны раз, калі старонка праглядаецца. Каб выкарыстоўваць лічыльнік, уключыце <em>Лічыць прагляды змесціва </em> на <a href="@statistics-settings">старонцы наладак статыстыкі</a>, і надайце неабходныя <a href="@permissions">правы</a> (<em>Праглядзець колькасць праглядаў змесціва </em>). Такім чынам, лічыльнік будзе бачным для карыстальнікаў.

source: The Statistics module shows you how often a given page is viewed, who viewed it, the previous page the user visited (referrer URL), and when it was viewed. These statistics are useful in determining how users are visiting and navigating your site. For more information, see the online handbook entry for the <a href="@statistics">Statistics module</a>.
be: Модуль Statistics паказвае вам, як часта праглядаюцца старонкі, хто праглядае іх, якія старонкі наведвае карыстальнік (пераходныя URL), і калі яны былі прагледжаны. Гэтая статыстыка карысна для вызначэння, як карыстальнікі наведваюць і перамяшчаюцца па вашаму сайту. Для атрымання большых звестак глядзіце допіс анлайн дапаможніка для <a href="@statistics">модуля Statistics</a>.

source: The Syslog module logs events by sending messages to the logging facility of your web server's operating system. Syslog is an operating system administrative logging tool that provides valuable information for use in system management and security auditing. Most suited to medium and large sites, Syslog provides filtering tools that allow messages to be routed by type and severity. For more information, see the online handbook entry for <a href='@syslog'>Syslog module</a> and PHP's <a href='@php_openlog'>openlog</a> and <a href='@php_syslog'>syslog</a> functions.
be: Модуль Syslog адмініструе падзеі адпраўленных паведамленняў журналіравання магчымасцяў сістэмы вашага вэб-сервера. Syslog - гэта інструмент журналіравання адміністратара аперацыйнай сістэмы, які прадастаўляе выжную інфармацыю для кіравання сістэмай і аудыце бяспекі. Больш падыходзіць для сярэдніх і буйных сайтаў. Syslog прадастаўляе інструменты фільтраў, якія даюць магчымасць паведамленням быць размеркаваным па тыпу і строгасці. Для большых звестак глядзіце анлайн дапаможнік для <a href='@syslog'>модуля Syslog</a> і для PHP <a href='@php_openlog'>openlog</a> і <a href='@php_syslog'>syslog</a> функцый.

source: The System module allows users with the appropriate permissions to enable and disable modules on the <a href="@modules">Modules administration page</a>. Drupal comes with a number of core modules, and each module provides a discrete set of features and may be enabled or disabled depending on the needs of the site. Many additional modules contributed by members of the Drupal community are available for download at the <a href="@drupal-modules">Drupal.org module page</a>.
be: Модуль System дае магчыамсць карыстальнікам з адпаведнымі дазволамі ўключаць і выключаць модулі на <a href="@modules">старонцы Адміністравання модуляў</a>. Drupal прапануе пэўную колькасць модуляў ядра і кожны модуль прадастаўляе асобны набор функцыяў і можа быць уключаны або выключаны ў залежнасці ад патрэбаў сайта. Шмат дадатковых модуляў прапануецца ўдзельнікамі Drupal супольнасці і даступна для сцягвання <a href="@drupal-modules">на старонцы модуляў Drupal.org</a>.

source: The System module allows users with the appropriate permissions to enable and disable themes on the <a href="@themes">Appearance administration page</a>. Themes determine the design and presentation of your site. Drupal comes packaged with several core themes, and additional contributed themes are available at the <a href="@drupal-themes">Drupal.org theme page</a>.
be: Модуль System дае магчымаць карыстальнікам з вызначанымі дазволамі ўключаць ці выключаць тэмы на <a href="@themes">адміністратарскай старонцы Знешні выгляд</a>. Тэмы вызначаюць дызайн і выгляд вашага сайта. Drupal пакет прапануе некалькі тэмаў ядра, а таксама ўнесеныя тэмы, якія даступныя на <a href="@drupal-themes">старонцы тэмаў Drupal.org</a>.

source: The System module allows users with the appropriate permissions to manage caching on the <a href='@cache-settings'>Performance settings page</a>. Drupal has a robust caching system that allows the efficient re-use of previously-constructed web pages and web page components. Pages requested by anonymous users are stored in a compressed format; depending on your site configuration and the amount of your web traffic tied to anonymous visitors, the caching system may significantly increase the speed of your site.
be: Модуль System дае магчымасць карыстальнікам з адмыслова вызначанымі дазволамі кіраваць кэшыраваннем на <a href='@cache-settings'>старонцы Прадукцыйнасці</a>. Drupal мае моцную сістэму кэшыравання, якая дазваляе эфектыўна выкарыстоўваць раней створаныя старонкі, ці кампаненты старонак. Старонкі, запытваемыя ананімнымі карыстальнікамі, захаваныя ў сціснутым фармаце. У залежнасці ад канфігурацыі вашага сайта і колькасці трафіка ад ананімных карыстальнікаў, сістэма кэшыравання можа значна павялічыць хуткасць вашага сайта.

source: The System module also handles basic configuration options for your site, including <a href="@date-time-settings">Date and time settings</a>, <a href="@file-system">File system settings</a>, <a href="@clean-url">Clean URL support</a>, <a href="@site-info">Site name and other information</a>, and a <a href="@maintenance-mode">Maintenance mode</a> for taking your site temporarily offline.
be: Сістэмны модуль таксама адказвае за базавыя опцыі канфігурацыі, у тым ліку <a href="@date-time-settings">Наладкі даты і часу</a>, <a href="@file-system">Сістэмныя наладкі файла</a>, <a href="@clean-url">Пачысціць падтрымку URL</a>, <a href="@site-info">Назва сайта і іншая інфармацыя</a>, і <a href="@maintenance-mode">Рэжым падтрымкі</a> для часовага адключэння Вашага сайта.

source: The System module is integral to the site, and provides basic but extensible functionality for use by other modules and themes. Some integral elements of Drupal are contained in and managed by the System module, including caching, enabling and disabling modules and themes, preparing and displaying the administrative page, and configuring fundamental site settings. A number of key system maintenance operations are also part of the System module. For more information, see the online handbook entry for <a href="@system">System module</a>.
be: Модуль System неад'емная частка сайта. Ён прадастаўляе базу, але для пашыранай функцыянальнасці неабходна выкарыстоўваць іншыя модулі ці тэмы. Некалькі неад'емных элементаў Drupal утрымліваецца і кіруецца модулем System, уключая кэшыраванне, дазвол і забарону модуляў і тэмаў, падрыхтоўка і адлюстраванне адміністратарскіх старонак, канфігураванне фундамельтальных наладак сайта. Колькасць ключавых падтрымліваючых аперацыяў таксама частка модуля System. Для атрымання большых звестак, глядзіце запіс анлайн дапаможніка для <a href="@system">модуля System</a>.

source: The Taxonomy module allows you to classify the content of your website. To classify content, you define <em>vocabularies</em> that contain related <em>terms</em>, and then assign the vocabularies to content types. For more information, see the online handbook entry for the <a href="@taxonomy">Taxonomy module</a>.
be: Модуль Taxonomy дазваляе вам класіфікаваць змесціва вашага сайту. Каб класіфікаваць змесціва, вы вызначаеце <em>слоўнікі</em>, якія ўтрымліваюць звязаныя <em>тэрміны</em>, і затым назначаеце гэтыя слоўнікі да адпаведных тыпаў змесціва. Каб атрымаць дадатковую інфармацыю, чытайце ў сеціўным даведніку пра <a href="@taxonomy">модуль Taxonomy</a>.
